In [1]:
import pandas as pd
df = pd.read_excel("stockexcel.XLSX","Sheet1")
df

     TICKERS            EPS  REVENUE PRICE      PEOPLE
0     google          27.82       87   845  larry page
1    walmart           4.61      484    65        n.a.
2  microsoft             -1       85    64  bill gates
3   reliance  not available       50  1023      mukesh
4       tata            5.6       -1  n.a.       ratan